In [2]:
import pandas as pd
import numpy as np

## **A. Groupby Function in Pandas**

In [12]:
df = pd.DataFrame([
    {'nama':'Andi','fisika':90, 'biologi': 78},
    {'nama':'Andi','fisika':95, 'biologi': 80},
    {'nama':'Andi','fisika':92, 'biologi': 82},
    {'nama':'Budi','fisika':90, 'biologi': 95},
    {'nama':'Budi','fisika':80, 'biologi': 98},
    {'nama':'Budi','fisika':88, 'biologi': 90}
])
df

   nama  fisika  biologi
0  Andi      90       78
1  Andi      95       80
2  Andi      92       82
3  Budi      90       95
4  Budi      80       98
5  Budi      88       90

In [20]:
dfGroup = df.groupby('nama')
dfGroup.mean()

         fisika    biologi
nama
Andi  92.333333  80.000000
Budi  86.000000  94.333333

In [14]:
dfGroup.groups.keys()

dict_keys(['Andi', 'Budi'])

In [15]:
dfGroup.min()

      fisika  biologi
nama
Andi      90       78
Budi      80       90

In [16]:
dfGroup.max()

      fisika  biologi
nama
Andi      95       82
Budi      90       98

In [17]:
dfGroup.mean()

         fisika    biologi
nama
Andi  92.333333  80.000000
Budi  86.000000  94.333333

In [27]:
dfGroup.get_group('Andi').max()['fisika']

95

In [29]:
df[df['nama'] == 'Andi']['fisika'].max()

95

## **Concat Using Pandas**

Cocok digunakan untuk DataFrame yang propertinya berbeda

In [33]:
df1 = pd.DataFrame([
    {'nama':'Andi','fisika':90, 'biologi': 78},
    {'nama':'Budi','fisika':95, 'biologi': 80},
    {'nama':'Caca','fisika':92, 'biologi': 82}
])
df2 = pd.DataFrame([
    {'nama':'Didi','fisika':90, 'biologi': 95},
    {'nama':'Euis','fisika':80, 'biologi': 98},
    {'nama':'Fafa','fisika':88, 'biologi': 90}
])

In [34]:
dfX = pd.concat([df1,df2])
dfX

   nama  fisika  biologi
0  Andi      90       78
1  Budi      95       80
2  Caca      92       82
0  Didi      90       95
1  Euis      80       98
2  Fafa      88       90

In [36]:
#memanggil dengan index
dfX.iloc[3]

nama       Didi
fisika       90
biologi      95
Name: 0, dtype: object

In [38]:
#memanggil dengan nama index
dfX.loc[0]

   nama  fisika  biologi
0  Andi      90       78
0  Didi      90       95

In [39]:
#Mengabaikan (ignore) index dari data awal dan membuat index sesuai urutan
dfY = pd.concat([df1,df2], ignore_index=True)
dfY

   nama  fisika  biologi
0  Andi      90       78
1  Budi      95       80
2  Caca      92       82
3  Didi      90       95
4  Euis      80       98
5  Fafa      88       90

In [43]:
df3 = pd.DataFrame([
    {'nama':'Andi','fisika':90, 'biologi': 78},
    {'nama':'Budi','fisika':95, 'biologi': 80},
    {'nama':'Caca','fisika':92, 'biologi': 82}
])
df4 = pd.DataFrame([
    {'nama':'Didi','math':90, 'biologi': 95},
    {'nama':'Euis','math':80, 'biologi': 98},
    {'nama':'Fafa','math':88, 'biologi': 90}
])
dfY = pd.concat([df3,df4], ignore_index=True, sort=False)
dfY

   nama  fisika  biologi  math
0  Andi    90.0       78   NaN
1  Budi    95.0       80   NaN
2  Caca    92.0       82   NaN
3  Didi     NaN       95  90.0
4  Euis     NaN       98  80.0
5  Fafa     NaN       90  88.0

In [55]:
df3 = pd.DataFrame([
    {'nama':'Andi','fisika':90, 'biologi': 78},
    {'nama':'Budi','fisika':95, 'biologi': 80},
    {'nama':'Caca','fisika':92, 'biologi': 82}
], index = [0,1,2])
df4 = pd.DataFrame([
    {'nama':'Budi','math':90, 'kimia': 95},
    {'nama':'Andi','math':80, 'kimia': 98},
    {'nama':'Caca','math':88, 'kimia': 90}
], index = [1,0,2])
dfY = pd.concat([df3,df4], axis=1, ignore_index=True, sort=False)
dfY

      0   1   2     3   4   5
0  Andi  90  78  Andi  80  98
1  Budi  95  80  Budi  90  95
2  Caca  92  82  Caca  88  90

## **Merge**

Cocok digunakan untuk data yang sama propertinya

In [56]:
df1 = pd.DataFrame([
    {'nama':'Andi','fisika':90, 'biologi': 78},
    {'nama':'Budi','fisika':95, 'biologi': 80},
    {'nama':'Caca','fisika':92, 'biologi': 82}
])
df2 = pd.DataFrame([
    {'nama':'Budi','math':90, 'kimia': 95},
    {'nama':'Andi','math':80, 'kimia': 98},
    {'nama':'Caca','math':88, 'kimia': 90}
])
dfX = pd.merge(df1,df2)
dfX

   nama  fisika  biologi  math  kimia
0  Andi      90       78    80     98
1  Budi      95       80    90     95
2  Caca      92       82    88     90

In [58]:
df1 = pd.DataFrame([
    {'nama':'Andi','fisika':90, 'biologi': 78},
    {'nama':'Budi','fisika':95, 'biologi': 80},
    {'nama':'Caca','fisika':92, 'biologi': 82},
    {'nama':'Deni'}
])
df2 = pd.DataFrame([
    {'nama':'Budi','math':90, 'kimia': 95},
    {'nama':'Andi','math':80, 'kimia': 98},
    {'nama':'Caca','math':88, 'kimia': 90},
    {'nama':'Deni','math':88, 'kimia': 90}
])
dfX = pd.merge(df1,df2)
dfX

   nama  fisika  biologi  math  kimia
0  Andi    90.0     78.0    80     98
1  Budi    95.0     80.0    90     95
2  Caca    92.0     82.0    88     90
3  Deni     NaN      NaN    88     90

Jika ada kelebihan baris di salah satu dataframe, maka baris yang lebih itu tidak akan ditampilkan saat di-mmerge

In [61]:
df1 = pd.DataFrame([
    {'nama':'Andi','fisika':90, 'biologi': 78},
    {'nama':'Budi','fisika':95, 'biologi': 80},
    {'nama':'Caca','fisika':92, 'biologi': 82}
])
df2 = pd.DataFrame([
    {'nama':'Budi','math':90, 'kimia': 95},
    {'nama':'Andi','math':80, 'kimia': 98},
    {'nama':'Caca','math':88, 'kimia': 90},
    {'nama':'Deni','math':88, 'kimia': 90}
])
dfX = pd.merge(df1,df2, on='nama', how='outer')
dfX

   nama  fisika  biologi  math  kimia
0  Andi    90.0     78.0    80     98
1  Budi    95.0     80.0    90     95
2  Caca    92.0     82.0    88     90
3  Deni     NaN      NaN    88     90

Dalam merge bisa menggunakan syntax **how** dengan pilihan:
1. Outer join
2. Left join
3. Right join

Secara default, merge akan menggunakan inner join

## **Pivot**

multi index

In [14]:
df = pd.DataFrame([
    {'test':1,'nama':'Andi','fisika':90, 'biologi': 78},
    {'test':2,'nama':'Andi','fisika':95, 'biologi': 80},
    {'test':3,'nama':'Andi','fisika':92, 'biologi': 82},
    {'test':1,'nama':'Budi','fisika':80, 'biologi': 88},
    {'test':2,'nama':'Budi','fisika':85, 'biologi': 89},
    {'test':3,'nama':'Budi','fisika':72, 'biologi': 72}
])
df = df.pivot(index='test', columns='nama')
df

     fisika      biologi
nama   Andi Budi    Andi Budi
test
1        90   80      78   88
2        95   85      80   89
3        92   72      82   72

In [80]:
df['fisika']

nama  Andi  Budi
test
1       90    80
2       95    85
3       92    72

In [81]:
# mencari nilai fisika Andi di test pertama
df['fisika']['Andi'].loc[1]

90

In [86]:
# mencari nilai rata-rata fisika Andi
df['fisika']['Andi'].mean()

92.33333333333333

### **Cara lain untuk pivot**

In [3]:
df = pd.DataFrame({
    'mapel': ['biologi', 'biologi', 'biologi','fisika', 'fisika', 'fisika'],
    'test': [1,2,3,1,2,3],
    'Andi': [78,80,82,90,95,92],
    'Budi': [88,89,72,80,85,72]
})

#multi index => test dan mapel
# df = df.set_index(['test','mapel']).unstack()
# df = df.swaplevel(0,1,1).sort_index(1)
df

     mapel  test  Andi  Budi
0  biologi     1    78    88
1  biologi     2    80    89
2  biologi     3    82    72
3   fisika     1    90    80
4   fisika     2    95    85
5   fisika     3    92    72

In [109]:
df1 = pd.DataFrame([
    {'test':1,'nama':'Andi','fisika':90, 'biologi': 78},
    {'test':2,'nama':'Deni','fisika':95, 'biologi': 80},
    {'test':3,'nama':'Caca','fisika':92, 'biologi': 82}
])

df2 = pd.DataFrame([
    {'test':1,'nama':'Ali','fisika':90, 'biologi': 78},
    {'test':2,'nama':'Budi','fisika':95, 'biologi': 80},
    {'test':3,'nama':'Euis','fisika':92, 'biologi': 82}
])

df = pd.concat([df1,df2], ignore_index=True)
df


df = pd.concat([df1,df2], keys=['data 1','data 2'])
df

          test  nama  fisika  biologi
data 1 0     1  Andi      90       78
       1     2  Deni      95       80
       2     3  Caca      92       82
data 2 0     1   Ali      90       78
       1     2  Budi      95       80
       2     3  Euis      92       82